In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import env

from sklearn.model_selection import train_test_split

In [2]:
import wrangle

from wrangle import wrangle_telco

from wrangle import split

In [3]:
import scale

from scale import scale_data

In [4]:
df = wrangle_telco()

In [5]:
df.head()

             monthly_charges  tenure  total_charges
customer_id
0013-SMEOE            109.70      71        7904.25
0014-BMAQU             84.65      63        5377.80
0016-QLJIS             90.45      65        5957.90
0017-DINOC             45.20      54        2460.55
0017-IUDMW            116.80      72        8456.75

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1685 entries, 0013-SMEOE to 9995-HOTOH
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   monthly_charges  1685 non-null   float64
 1   tenure           1685 non-null   int64
 2   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1)
memory usage: 52.7+ KB

In [7]:
train, validate, test = split(df)

In [8]:
train.head()

             monthly_charges  tenure  total_charges
customer_id
6586-MYGKD             76.95      70        5289.80
1270-XKUCC             19.70      30         599.25
6425-JWTDV             19.25      48         855.10
6916-HIJSE             84.85      65        5459.20
8173-RXAYP             19.70      24         452.55

In [9]:
train.shape

(943, 3)

In [10]:
validate.head()

             monthly_charges  tenure  total_charges
customer_id
5707-ZMDJP             69.70      53        3729.60
4827-DPADN             83.30      72        6042.70
1897-OKVMW             90.60      64        5817.45
8990-YOZLV             66.90      69        4577.90
3428-MMGUB             89.55      60        5231.20

In [11]:
validate.shape

(405, 3)

In [12]:
test.head()

             monthly_charges  tenure  total_charges
customer_id
1904-WAJAA             64.35      24        1558.65
4835-YSJMR             49.80      39        1971.15
7771-CFQRQ             63.80      47        3007.25
5702-KVQRD             82.55      71        5832.65
3796-ENZGF             67.25      63        4234.15

In [13]:
test.shape

(337, 3)

In [14]:
train_scaled, validate_scaled, test_scaled = scale_data(train, validate, test)

In [15]:
train_scaled.head()

   monthly_charges    tenure  total_charges
0         0.582209  0.971831       0.609033
1         0.009995  0.408451       0.066898
2         0.005497  0.661972       0.096469
3         0.661169  0.901408       0.628612
4         0.009995  0.323944       0.049942

In [16]:
train.head()

             monthly_charges  tenure  total_charges
customer_id
6586-MYGKD             76.95      70        5289.80
1270-XKUCC             19.70      30         599.25
6425-JWTDV             19.25      48         855.10
6916-HIJSE             84.85      65        5459.20
8173-RXAYP             19.70      24         452.55